##############################################################################################################
'''
Основной запускающий файл.

Определяем переменные для доступа к сайтам.
Получаем от пользователя необходимые данные для поиска.
Выводим на экран полученную информацию
'''
##############################################################################################################

from SuperJobAPI import SuperJobAPI
from HeadHunterAPI import HeadHunterAPI


def main():
	'''
	Главная функция
	:return:
	'''
	
	hh_api = HeadHunterAPI()
	sj_api = SuperJobAPI()
	
	hh_api.get_vacancies('Python')
	sj_api.get_vacancies('Python')
	
	hh_api.save_vacancies()
	sj_api.save_vacancies()

if __name__ == '__main__':
	main()

##############################################################################################################