##############################################################################################################
'''
Основной запускающий файл.

Определяем переменные для доступа к сайтам.
Получаем от пользователя необходимые данные для поиска.
Выводим на экран полученную информацию
'''
##############################################################################################################

from SuperJobAPI import SuperJobAPI
from HeadHunterAPI import HeadHunterAPI


def main():
	'''
	Главная функция
	:return:
	'''
	
	hh_api = HeadHunterAPI()
	ss_api = SuperJobAPI()
	
	hh_vacancies = hh_api.get_vacancies()
	ss_vacancies = ss_api.get_vacancies()

if __name__ == '__main__':
	main()

##############################################################################################################