##############################################################################################################
'''
Основной запускающий файл
'''
##############################################################################################################

from SuperJobAPI import SuperJobAPI
from HeadHunterAPI import HeadHunterAPI


def main():
	'''
	Главная функция
	:return:
	'''
	
	ss_api = SuperJobAPI()
	hh_api = HeadHunterAPI()

if __name__ == '__main__':
	main()

##############################################################################################################